I ran load tests on this commit just to try it and make sure it works. The uniqueness can be seen in the TF apply with output like: 
```
  # module.load-test.module.consul_servers.aws_security_group.lc_security_group will be created
  + resource "aws_security_group" "lc_security_group" {
      + arn                    = (known after apply)
      + description            = "Security group for the 9ae1b1fc8-server launch configuration" <----- here
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "9ae1b1fc8-server"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "9ae1b1fc8-server" <----- here
        }
      + tags_all               = {
          + "Name" = "9ae1b1fc8-server" <----- here
        }
      + vpc_id                 = (known after apply)
    }
```